In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.3

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0   6   7   4  11   7
1   4  13  13  14   4
2   7   8   5   8  15
3  12   8  16   5   4
4  12   6   3  12   9

In [3]:
df.query('A > 10')

    A  B   C   D  E
3  12  8  16   5  4
4  12  6   3  12  9

In [4]:
rerata = df['A'].mean()
rerata

np.float64(8.2)

In [5]:
df.query('A > @rerata')

    A  B   C   D  E
3  12  8  16   5  4
4  12  6   3  12  9